Repository: SerhiiAloshkin/SudokuiOS
Catalog: SudokuiOS/Localizable.xcstrings
Source language: en
Languages: fr, uk

source: No combinations found.
fr: Aucune combinaison trouvée.
uk: Комбінацій не знайдено.

source: No custom levels yet
fr: Aucun niveau personnalisé pour l'instant
uk: Власних рівнів ще немає

source: NO REPEATS
fr: AUCUNE RÉPÉTITION
uk: БЕЗ ПОВТОРІВ

source: No valid combinations
fr: Aucune combinaison valide
uk: Немає дійсних комбінацій

source: Non-Consec
fr: Non-Cons.
uk: Непослід.

source: Non-Consecutive
fr: Non-Consécutif
uk: Непослідовний

source: NON-CONSECUTIVE
fr: NON-CONSÉCUTIF
uk: НЕПОСЛІДОВНИЙ

source: Note: Automated verification can make mistakes or might not cover all logical paths a human can.
fr: Remarque : la vérification automatique peut se tromper ou ne pas couvrir tous les raisonnements logiques qu'un humain pourrait suivre.
uk: Примітка: автоматична перевірка може помилятися або не охоплювати всі логічні шляхи, доступні людині.

source: Numbers along the arrow must sum to the number in the circle.
fr: Les chiffres le long de la flèche doivent totaliser le chiffre dans le cercle.
uk: Числа вздовж стрілки мають у сумі давати число в колі.

source: Numbers cannot repeat in the same row, column, or 3x3 box.
fr: Les chiffres ne peuvent pas se répéter dans la même ligne, colonne ou bloc 3x3.
uk: Цифри не можуть повторюватися в тому самому рядку, стовпці чи блоці 3x3.

source: Numbers in cages must sum to the corner clue and cannot repeat.
fr: Les chiffres dans les cages doivent totaliser l'indice du coin et ne peuvent pas se répéter.
uk: Числа в клітках мають у сумі давати підказку в кутку й не можуть повторюватися.

source: Numbers in cages must sum to the small top-left clue.
fr: Les chiffres dans les cages doivent totaliser le petit indice en haut à gauche.
uk: Числа в клітках мають у сумі давати маленьку підказку у верхньому лівому куті.

source: Numbers must strictly increase from the bulb to the tip.
fr: Les chiffres doivent strictement augmenter du bulbe jusqu'à la pointe.
uk: Числа мають суворо зростати від кульки до кінчика.

source: Numpad & Input Modes
fr: Pavé numérique et modes de saisie
uk: Цифрова панель і режими введення

source: Odd
fr: Impair
uk: Непарне

source: ODD / EVEN
fr: IMPAIR / PAIR
uk: НЕПАРНЕ / ПАРНЕ

source: Odd-Even
fr: Impair-Pair
uk: Непарне-Парне

source: Odd-Even Sudoku
fr: Sudoku Impair-Pair
uk: Судоку «Непарне-Парне»

source: Odd/Even
fr: Impair/Pair
uk: Непарне/Парне

source: Opens a direct email line to the developers for feedback or bug reports.
fr: Ouvre une messagerie directe avec les développeurs pour vos retours ou signalements de bugs.
uk: Відкриває пряму пошту для зв'язку з розробниками щодо відгуків або звітів про помилки.

source: Opens highlight, gameplay, appearance, and support settings without leaving your level.
fr: Ouvre les réglages de surbrillance, de jeu, d'apparence et d'assistance sans quitter votre niveau.
uk: Відкриває налаштування підсвічування, гри, вигляду та підтримки, не виходячи з рівня.

source: Opens the rule pages for this level's active variants. Tap "Full Guide" inside it to open this Encyclopedia without leaving your level.
fr: Ouvre les pages de règles des variantes actives de ce niveau. Appuyez sur « Guide complet » pour ouvrir cette encyclopédie sans quitter votre niveau.
uk: Відкриває сторінки правил активних варіантів цього рівня. Натисніть «Повний посібник», щоб відкрити цю енциклопедію, не виходячи з рівня.

source: Orthogonally adjacent cells cannot contain digits that are consecutive (e.g. 3 next to 4).
fr: Les cellules adjacentes orthogonalement ne peuvent pas contenir des chiffres consécutifs (ex. 3 à côté de 4).
uk: Клітинки, що межують по горизонталі чи вертикалі, не можуть містити послідовні цифри (напр. 3 поруч із 4).

source: Outstanding!
fr: Exceptionnel !
uk: Видатно!

source: Palette Mode
fr: Mode Palette
uk: Режим палітри

source: Paused
fr: En pause
uk: Пауза

source: Pen Mode
fr: Mode Stylo
uk: Режим ручки

source: Pencil (Notes)
fr: Crayon (Notes)
uk: Олівець (нотатки)

source: Perfect!
fr: Parfait !
uk: Ідеально!

source: Placing a Pen digit automatically erases that number from notes in its row, column, and 3x3 box.
fr: Placer un chiffre en mode Stylo efface automatiquement ce chiffre des notes de sa ligne, sa colonne et son bloc 3x3.
uk: Розміщення цифри в режимі ручки автоматично видаляє це число з нотаток у її рядку, стовпці та блоці 3x3.

source: Placing Dots
fr: Placer des points
uk: Розміщення крапок

source: Play Campaign
fr: Jouer à la campagne
uk: Грати кампанію

source: Please select an empty cell to use a hint.
fr: Veuillez sélectionner une cellule vide pour utiliser un indice.
uk: Будь ласка, виберіть порожню клітинку, щоб скористатися підказкою.

source: Potential
fr: Potentiel
uk: Потенціал

source: Random Cell
fr: Cellule aléatoire
uk: Випадкова клітинка

source: Re-applies an action you just reverted.
fr: Réapplique une action que vous venez d'annuler.
uk: Повторно застосовує щойно скасовану дію.

source: Redo
fr: Rétablir
uk: Повторити

source: Reset Level
fr: Réinitialiser le niveau
uk: Скинути рівень

source: Restart
fr: Recommencer
uk: Перезапустити

source: Restart Level
fr: Recommencer le niveau
uk: Перезапустити рівень

source: Restart Level?
fr: Recommencer le niveau ?
uk: Перезапустити рівень?

source: Reverts your very last action (digit, note, or color).
fr: Annule votre toute dernière action (chiffre, note ou couleur).
uk: Скасовує вашу останню дію (цифру, нотатку чи колір).

source: Review the Knight's move (L-shape). Same numbers cannot be a Knight's move apart.
fr: Rappel du mouvement du cavalier (forme en L). Deux chiffres identiques ne peuvent pas être séparés par un mouvement de cavalier.
uk: Пригадайте хід коня (Г-подібний). Однакові числа не можуть бути на відстані ходу коня одне від одного.

source: Rule Toggles
fr: Options de règles
uk: Перемикачі правил

source: Rules
fr: Règles
uk: Правила

source: Same numbers cannot be in any adjacent cell, including diagonals.
fr: Deux chiffres identiques ne peuvent pas être dans des cellules adjacentes, y compris en diagonale.
uk: Однакові числа не можуть бути в жодній сусідній клітинці, включно з діагоналями.

source: Sandwich Clue
fr: Indice Sandwich
uk: Підказка «Сандвіч»

source: Sandwich Clues
fr: Indices Sandwich
uk: Підказки «Сандвіч»

source: Sandwich Sudoku
fr: Sudoku Sandwich
uk: Судоку «Сандвіч»

source: Save
fr: Enregistrer
uk: Зберегти

source: Saves your current session and returns to the Main Menu.
fr: Enregistre votre session actuelle et revient au menu principal.
uk: Зберігає поточну сесію та повертає до головного меню.

source: Select Color
fr: Choisir une couleur
uk: Виберіть колір

source: Select Level
fr: Choisir un niveau
uk: Виберіть рівень

source: Selected Cell
fr: Cellule sélectionnée
uk: Вибрана клітинка

source: Settings
fr: Réglages
uk: Налаштування

source: Show Combination Helpers
fr: Afficher les assistants de combinaisons
uk: Показувати помічники комбінацій

source: Show Hint Button
fr: Afficher le bouton d'indice
uk: Показувати кнопку підказки

source: Show Mistakes
fr: Afficher les erreurs
uk: Показувати помилки

source: Smart Notes
fr: Notes intelligentes
uk: Розумні нотатки

source: Solved
fr: Résolus
uk: Розв'язані

source: Solved: %@
fr: Résolu en : %@
uk: Розв'язано за: %@

source: Solved: %lld / %lld
fr: Résolus : %lld / %lld
uk: Розв'язано: %lld / %lld

source: Splendid!
fr: Splendide !
uk: Чудово!

source: Squares contain Even digits (2,4,6,8). Circles contain Odd digits (1,3,5,7,9).
fr: Les carrés contiennent des chiffres pairs (2,4,6,8). Les cercles contiennent des chiffres impairs (1,3,5,7,9).
uk: Квадрати містять парні цифри (2,4,6,8). Кола містять непарні цифри (1,3,5,7,9).

source: Standard 9x9 Sudoku grid.
fr: Grille de Sudoku standard 9x9.
uk: Стандартна сітка судоку 9x9.

source: Start Level
fr: Démarrer le niveau
uk: Почати рівень

source: Status
fr: Statut
uk: Статус

source: Stops the numpad from greying out and disabling numbers that have been placed 9 times.
fr: Empêche le pavé numérique de griser et désactiver les chiffres placés 9 fois.
uk: Не дозволяє цифровій панелі затемнювати й вимикати числа, розміщені 9 разів.

source: Success
fr: Succès
uk: Успішно

source: Sudoku Variants (Rules)
fr: Variantes de Sudoku (règles)
uk: Варіанти судоку (правила)

source: Sudoku Versa Feedback
fr: Retour Sudoku Versa
uk: Відгук про Sudoku Versa

source: Sum (0 or 2-35)
fr: Somme (0 ou 2-35)
uk: Сума (0 або 2-35)

source: Superb!
fr: Superbe !
uk: Чудово виконано!

source: Support
fr: Assistance
uk: Підтримка

source: Swipe across the grid to select multiple cells. Your inputs will apply to all selected cells simultaneously.
fr: Glissez sur la grille pour sélectionner plusieurs cellules. Vos saisies s'appliqueront à toutes les cellules sélectionnées simultanément.
uk: Проведіть пальцем по сітці, щоб вибрати кілька клітинок. Ваше введення застосується до всіх вибраних клітинок одночасно.

source: Switch between Light mode, Dark mode, or System (which follows your device appearance).
fr: Basculez entre le mode Clair, le mode Sombre ou Système (qui suit l'apparence de votre appareil).
uk: Перемикайтеся між світлим режимом, темним режимом або системним (що відповідає вигляду пристрою).

source: System
fr: Système
uk: Системна

source: Tap a cell to focus your input.
fr: Touchez une cellule pour y saisir une valeur.
uk: Торкніться клітинки, щоб почати введення.

source: Tap a Sandwich clue number, or select a Killer cage and tap the cage-helper button in the header, to open a list of every remaining valid digit combination for it. Tap an entry to cross it off. Controlled by the "Show Combination Helpers" and "Auto-Filter Combinations" settings below.
fr: Touchez un indice Sandwich, ou sélectionnez une cage Killer puis le bouton d'assistance dans l'en-tête, pour afficher la liste des combinaisons de chiffres encore valides. Touchez une entrée pour la barrer. Contrôlé par les réglages « Afficher les assistants de combinaisons » et « Filtrage automatique des combinaisons » ci-dessous.
uk: Торкніться числа підказки «Сандвіч» або виберіть клітку Кіллер і натисніть кнопку помічника в заголовку, щоб відкрити список усіх можливих комбінацій цифр. Торкніться запису, щоб викреслити його. Керується налаштуваннями «Показувати помічники комбінацій» і «Автофільтрація комбінацій» нижче.

source: Tap the Kropki tool, select White or Black, then tap two orthogonally-adjacent cells to link them.
fr: Touchez l'outil Kropki, choisissez Blanc ou Noir, puis touchez deux cellules adjacentes pour les relier.
uk: Торкніться інструмента Кропкі, виберіть білий або чорний, потім торкніться двох суміжних клітинок, щоб з'єднати їх.

source: Tap the slots around the perimeter of the grid to enter sums (must be 0 or 2-35).
fr: Touchez les emplacements autour de la grille pour saisir des sommes (0 ou entre 2 et 35).
uk: Торкніться комірок по периметру сітки, щоб ввести суми (мають бути 0 або від 2 до 35).

source: Tap to Select
fr: Toucher pour sélectionner
uk: Торкніться, щоб вибрати

source: Tap Validate to run a logical solver over your level — this is optional, not required to save, and confirms the puzzle is human-solvable. It does not guarantee the solution is unique.
fr: Touchez Valider pour lancer un solveur logique sur votre niveau — c'est facultatif, non requis pour enregistrer, et cela confirme que la grille est résoluble par un humain. Cela ne garantit pas que la solution est unique.
uk: Натисніть «Перевірити», щоб запустити логічний розв'язувач для вашого рівня — це необов'язково, не потрібно для збереження, і підтверджує, що головоломку можна розв'язати вручну. Це не гарантує унікальності розв'язку.

source: The selected cell is already correct!
fr: La cellule sélectionnée est déjà correcte !
uk: Вибрана клітинка вже правильна!

source: The Versa Encyclopedia
fr: L'Encyclopédie Versa
uk: Енциклопедія Versa

source: Theme
fr: Thème
uk: Тема

source: There are conflicts on the board. Please find and fix them to complete the puzzle.
fr: Il y a des conflits sur la grille. Trouvez-les et corrigez-les pour terminer la grille.
uk: На дошці є конфлікти. Знайдіть і виправте їх, щоб завершити головоломку.

source: There's no per-shape edit control — to change or remove a Thermo, Arrow, Cage, or Kropki dot, select the Erase tool and tap any cell it touches; this deletes the entire shape so you can redraw it.
fr: Il n'existe pas de contrôle d'édition par forme — pour modifier ou supprimer un Thermomètre, une Flèche, une Cage ou un point Kropki, sélectionnez l'outil Effacer et touchez une cellule qu'il touche ; cela supprime toute la forme afin que vous puissiez la redessiner.
uk: Немає окремого керування редагуванням фігур — щоб змінити або видалити Термометр, Стрілку, Клітку чи крапку Кропкі, виберіть інструмент «Стерти» й торкніться будь-якої клітинки, якої вона стосується; це видалить всю фігуру, і ви зможете намалювати її заново.

source: Thermo Sudoku
fr: Sudoku Thermo
uk: Судоку «Термо»

source: THERMOMETERS
fr: THERMOMÈTRES
uk: ТЕРМОМЕТРИ

source: This mode highlights all valid positions for a number, which can make the game significantly easier. You might find the puzzles less challenging or lose interest more quickly. Do you still want to activate it?
fr: Ce mode met en surbrillance toutes les positions valides pour un chiffre, ce qui peut rendre le jeu beaucoup plus facile. Vous pourriez trouver les grilles moins stimulantes ou perdre plus vite l'intérêt. Voulez-vous quand même l'activer ?
uk: Цей режим підсвічує всі дійсні позиції для числа, що може значно спростити гру. Головоломки можуть здатися менш складними, і ви можете швидше втратити інтерес. Ви все ще хочете його увімкнути?

source: This will clear all your progress.
fr: Cela effacera toute votre progression.
uk: Це видалить увесь ваш прогрес.

source: This will clear your time, notes, and progress on this level. Your best time is kept.
fr: Cela effacera votre temps, vos notes et votre progression sur ce niveau. Votre meilleur temps est conservé.
uk: Це видалить ваш час, нотатки та прогрес на цьому рівні. Ваш рекордний час буде збережено.

source: TIME
fr: TEMPS
uk: ЧАС

source: Timer
fr: Chronomètre
uk: Таймер

source: Toggles the visibility of the Hint system on the game screen. Hints are always hidden on custom levels regardless of this setting, since there's no solution to hint from.
fr: Active ou masque le système d'indices sur l'écran de jeu. Les indices sont toujours masqués sur les niveaux personnalisés, quel que soit ce réglage, car il n'y a pas de solution à partir de laquelle donner un indice.
uk: Вмикає або вимикає видимість системи підказок на ігровому екрані. На власних рівнях підказки завжди приховані незалежно від цього налаштування, оскільки немає розв'язку, з якого можна підказувати.

source: Toolbar & Actions
fr: Barre d'outils et actions
uk: Панель інструментів і дії

source: Tracks your solving progress. Pause to stop the clock.
fr: Suit votre progression. Mettez en pause pour arrêter le chronomètre.
uk: Відстежує ваш прогрес. Поставте на паузу, щоб зупинити годинник.

source: Undo
fr: Annuler
uk: Скасувати

source: Unsolved
fr: Non résolus
uk: Нерозв'язані

source: Updated successfully!
fr: Mise à jour réussie !
uk: Успішно оновлено!

source: Use the ⋯ menu on a level in My Custom Levels to reopen it here with everything pre-filled, ready to change and re-save.
fr: Utilisez le menu ⋯ d'un niveau dans Mes niveaux personnalisés pour le rouvrir ici, prérempli et prêt à modifier puis réenregistrer.
uk: Скористайтеся меню ⋯ на рівні в розділі «Мої власні рівні», щоб знову відкрити його тут із заповненими даними, готовими для зміни та повторного збереження.

source: Validate
fr: Valider
uk: Перевірити

source: Verification
fr: Vérification
uk: Перевірка

source: When Board Full
fr: Grille pleine
uk: Коли дошка заповнена

source: When On, only the currently selected cell is highlighted. Turn Off to access Detailed Mode.
fr: Lorsque activé, seule la cellule actuellement sélectionnée est en surbrillance. Désactivez pour accéder au mode Détaillé.
uk: Коли увімкнено, підсвічується лише поточна вибрана клітинка. Вимкніть, щоб отримати доступ до детального режиму.

source: While multiple cells are selected, highlighting shows Row/Column/Box relations instead of valid placement spots.
fr: Lorsque plusieurs cellules sont sélectionnées, la surbrillance montre les relations de ligne/colonne/bloc au lieu des emplacements valides.
uk: Коли вибрано кілька клітинок, підсвічування показує зв'язки рядок/стовпець/блок замість дійсних місць для розміщення.

source: White
fr: Blanc
uk: Білий

source: White dot = consecutive digits (e.g. 4-5). Black dot = double ratio (e.g. 4-8).
fr: Point blanc = chiffres consécutifs (ex. 4-5). Point noir = rapport double (ex. 4-8).
uk: Біла крапка = послідовні цифри (напр. 4-5). Чорна крапка = подвійне співвідношення (напр. 4-8).

source: White dot: Consecutive. Black dot: Ratio 1:2. Negative constraint applies!
fr: Point blanc : consécutif. Point noir : rapport 1:2. La contrainte négative s'applique !
uk: Біла крапка: послідовні. Чорна крапка: співвідношення 1:2. Діє негативне обмеження!

source: White dot: Difference is 1. Black dot: Ratio is 2:1. (1 & 2 can have either).
fr: Point blanc : différence de 1. Point noir : rapport de 2:1. (1 et 2 peuvent avoir l'un ou l'autre).
uk: Біла крапка: різниця 1. Чорна крапка: співвідношення 2:1. (1 і 2 можуть мати будь-яке з двох).

source: With 2 or more cells selected, highlighting switches from "where can this number go" to "which cells are related to every selected cell" — same row, column, or box as all of them. This is useful for finding cells where a candidate shared by your selected cells can be safely erased from notes, but it means Potential-mode highlighting (showing valid spots for a number) only works with a single cell selected.
fr: Avec 2 cellules sélectionnées ou plus, la surbrillance passe de « où ce chiffre peut-il aller » à « quelles cellules sont liées à chaque cellule sélectionnée » — même ligne, colonne ou bloc que toutes. Cela permet de repérer les cellules où un candidat commun peut être effacé des notes en toute sécurité, mais cela signifie que la surbrillance du mode Potentiel (emplacements valides pour un chiffre) ne fonctionne qu'avec une seule cellule sélectionnée.
uk: Коли вибрано 2 або більше клітинок, підсвічування змінюється з «куди може піти це число» на «які клітинки пов'язані з кожною вибраною клітинкою» — той самий рядок, стовпець або блок, що й усі вони. Це корисно для пошуку клітинок, де спільний кандидат можна безпечно видалити з нотаток, але це означає, що підсвічування режиму «Потенціал» (дійсні місця для числа) працює лише з однією вибраною клітинкою.

source: You cannot use a hint on a given clue.
fr: Vous ne pouvez pas utiliser un indice sur un chiffre déjà donné.
uk: Не можна використовувати підказку для вже заданої цифри.

source: You must complete the first 250 levels to unlock the advanced series.
fr: Vous devez terminer les 250 premiers niveaux pour débloquer la série avancée.
uk: Щоб відкрити серію для просунутих, потрібно пройти перші 250 рівнів.

source: You've made 3 mistakes.
fr: Vous avez fait 3 erreurs.
uk: Ви припустилися 3 помилок.

source: Your device is not configured to send emails. Please contact us at %@.
fr: Votre appareil n'est pas configuré pour envoyer des e-mails. Veuillez nous contacter à l'adresse %@.
uk: Ваш пристрій не налаштовано для надсилання листів. Зв'яжіться з нами за адресою %@.

source: Cage
uk: Клітка

source: CORRECT
uk: ПРАВИЛЬНО

source: Excellent!
uk: Відмінно!

source: INCORRECT
uk: НЕПРАВИЛЬНО

source: Killer
uk: Кіллер

source: Kropki
uk: Кропкі

source: Multi
uk: Мульти

source: Non-Cons
uk: Непослід.

source: Notes
uk: Нотатки

source: OK
uk: Гаразд

source: Pause
uk: Пауза

source: Restriction
uk: Обмеження

source: Sandwich
uk: Сандвіч

source: SANDWICH
uk: САНДВІЧ

source: Sudoku
uk: Судоку

source: Thermo
uk: Термо
